TexasInstruments/f29h85x-sdk/source/driverlib/uart.h
//###########################################################################
//
// FILE:   uart.h
//
// TITLE:  C29x UART driver
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef UART_H
#define UART_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup uart_api UART
//! \brief The UART module is used for UART configurations.
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "debug.h"

//*****************************************************************************
//
// Values that can be passed to UART_enableInterrupt,
// UART_disableInterrupt, and UART_clearInterruptStatus
// as the intFlags parameter, and returned from UART_getInterruptStatus.
//
//*****************************************************************************
#define UART_INT_DMATX          0x20000U     //!< DMA TX interrupt
#define UART_INT_DMARX          0x10000U     //!< DMA RX interrupt
#define UART_INT_9BIT           0x1000U      //!< 9-bit address match interrupt
#define UART_INT_OE             0x400U       //!< Overrun Error Interrupt Mask
#define UART_INT_BE             0x200U       //!< Break Error Interrupt Mask
#define UART_INT_PE             0x100U       //!< Parity Error Interrupt Mask
#define UART_INT_FE             0x080U       //!< Framing Error Interrupt Mask
#define UART_INT_RT             0x040U       //!< Receive Timeout Interrupt Mask
#define UART_INT_TX             0x020U       //!< Transmit Interrupt Mask
#define UART_INT_RX             0x010U       //!< Receive Interrupt Mask

//*****************************************************************************
//
// Values that can be passed to UART_setConfig as the config parameter
// and returned by UART_getConfig in the config parameter.
// Additionally, the UART_CONFIG_PAR_* subset can be passed to
// UART_setParityMode as the parity parameter, and are returned by
// UART_getParityMode.
//
//*****************************************************************************
#define UART_CONFIG_WLEN_8      0x00000060UL  //!< 8 bit data
#define UART_CONFIG_WLEN_7      0x00000040UL  //!< 7 bit data
#define UART_CONFIG_WLEN_6      0x00000020UL  //!< 6 bit data
#define UART_CONFIG_WLEN_5      0x00000000UL  //!< 5 bit data
#define UART_CONFIG_STOP_ONE    0x00000000UL  //!< 1 stop bit
#define UART_CONFIG_STOP_TWO    0x00000008UL  //!< 2 stop bits
#define UART_CONFIG_PAR_NONE    0x00000000UL  //!< No parity
#define UART_CONFIG_PAR_EVEN    0x00000006UL  //!< Even parity
#define UART_CONFIG_PAR_ODD     0x00000002UL  //!< Odd parity
#define UART_CONFIG_PAR_ONE     0x00000082UL  //!< Parity bit is one
#define UART_CONFIG_PAR_ZERO    0x00000086UL  //!< Parity bit is zero
#define UART_CONFIG_WLEN_MASK   0x00000060UL  //!< Mask for extracting wordlength
#define UART_CONFIG_STOP_MASK   0x00000008UL  //!< Mask for extracting stop bits
#define UART_CONFIG_PAR_MASK    0x00000086UL  //!< Mask for extracting parity

//*****************************************************************************
//
// Values that can be passed to UART_setFIFOLevel as the txLevel parameter
// and returned by UART_getFIFOLevel in the txLevel.
// These are 8 bit (1 byte) wide and 16 locations deep FIFOs.
// For example, to get a transmit interrupt after 4 data bytes are transmitted,
// we need a trigger after the transmit FIFO has 4 bytes with 4 locations deep,
// that is, 4 out of 16 locations deep which is 1/4 full.(UART_FIFO_TX2_8)
//
//*****************************************************************************
#define UART_FIFO_TX1_8      0x00000000UL  //!< Transmit interrupt at 1/8 Full
#define UART_FIFO_TX2_8      0x00000001UL  //!< Transmit interrupt at 1/4 Full
#define UART_FIFO_TX4_8      0x00000002UL  //!< Transmit interrupt at 1/2 Full
#define UART_FIFO_TX6_8      0x00000003UL  //!< Transmit interrupt at 3/4 Full
#define UART_FIFO_TX7_8      0x00000004UL  //!< Transmit interrupt at 7/8 Full

//*****************************************************************************
//
// Values that can be passed to UART_setFIFOLevel as the rxLevel parameter
// and returned by UART_getFIFOLevel in the rxLevel.
// These are 8 bit (1 byte) wide and 16 locations deep FIFOs.
// For example, to get a receive interrupt after 4 data bytes are received,
// we need a trigger after the receive FIFO has 4 bytes with 4 locations deep,
// that is, 4 out of 16 locations deep which is 1/4 full.(UART_FIFO_RX2_8)
//
//*****************************************************************************
#define UART_FIFO_RX1_8         0x00000000UL  //!< Receive interrupt at 1/8 Full
#define UART_FIFO_RX2_8         0x00000008UL  //!< Receive interrupt at 1/4 Full
#define UART_FIFO_RX4_8         0x00000010UL  //!< Receive interrupt at 1/2 Full
#define UART_FIFO_RX6_8         0x00000018UL  //!< Receive interrupt at 3/4 Full
#define UART_FIFO_RX7_8         0x00000020UL  //!< Receive interrupt at 7/8 Full

//*****************************************************************************
//
// Values that can be passed to UART_enableDMA() and UART_disableDMA().
//
//*****************************************************************************
#define UART_DMA_ERR_RXSTOP   0x00000004UL  //!< Stop DMA receive if UART error
#define UART_DMA_TX           0x00000002UL  //!< Enable DMA for transmit
#define UART_DMA_RX           0x00000001UL  //!< Enable DMA for receive

//*****************************************************************************
//
// Values returned from UART_getRxError().
//
//*****************************************************************************
#define UART_RXERROR_OVERRUN    0x00000008UL
#define UART_RXERROR_BREAK      0x00000004UL
#define UART_RXERROR_PARITY     0x00000002UL
#define UART_RXERROR_FRAMING    0x00000001UL

//*****************************************************************************
//
// Values that can be passed to UART_setTxIntMode() or returned from
// UART_getTxIntMode().
//
//*****************************************************************************
#define UART_TXINT_MODE_FIFO    0x00000000UL  //!< Trigger based on tx FIFOlevel
#define UART_TXINT_MODE_EOT     0x00000010UL  //!< Trigger when transmitter idle

//*****************************************************************************
//
// The system clock divider defining the maximum baud rate supported by the
// UART.
//
//*****************************************************************************
#define UART_CLK_DIVIDER        8U

//*****************************************************************************
//
// UART clock frequency in Hz.
// Value that can be passed to UART_setConfig() & UART_getConfig().
//
//*****************************************************************************
#define UART_CLK_FREQ        DEVICE_SYSCLK_FREQ  //!< CPU SYSCLK frequency

//
// Mask for all errors
//
#define UART_RSR_ALL_M  (UART_RSR_BE | UART_RSR_FE | UART_RSR_OE | UART_RSR_PE)

//*****************************************************************************
//
// SIR ( IrDA ) Low Power Baud macro. IrLPBaud16 is nominally 1.8432 MHz.
// Value that can be passed to UART_setIrDALPDivisor().
//
//*****************************************************************************
#define UART_CLK_IRLPBAUD16       1843200U

//*****************************************************************************
//
// UART interrupt type. Values that can be passed to UART_getInterruptStatus()
//
//*****************************************************************************
#define UART_RAW_INT         false //!< Raw interrupt
#define UART_MASKED_INT      true  //!< Masked interrupt
typedef bool UART_IntType;

//*****************************************************************************
//
// Values that can be passed to UART_enableSIR().
//
//*****************************************************************************
#define UART_SIR_LOWPOWER_DISABLE         false //!< Disable SIR Low-Power mode
#define UART_SIR_LOWPOWER_ENABLE          true  //!< Enable SIR Low-Power mode
typedef bool UART_SirLPMode;


//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks a UART base address.
//!
//! \param base is the base address of the UART port.
//!
//! This function determines if a UART port base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
UART_isBaseValid(uint32_t base)
{
    return(
           ((base & BASE_ADDR_MASK) == UARTA_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == UARTB_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == UARTC_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == UARTD_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == UARTE_BASE_FRAME(0U)) ||
           ((base & BASE_ADDR_MASK) == UARTF_BASE_FRAME(0U))
          );

